cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register>
          <name>SHPR2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SHPR2</displayName>
          <description>System Handler Priority Register 2</description>
          <addressOffset>0xD1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>Priority Of System Handler 11 - SVCall\n"0" denotes the highest priority and "3" denotes the lowest priority.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SHPR3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SHPR3</displayName>
          <description>System Handler Priority Register 3</description>
          <addressOffset>0xD20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_14</name>
              <description>Priority Of System Handler 14 - PendSV\n"0" denotes the highest priority and "3" denotes the lowest priority.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_15</name>
              <description>Priority Of System Handler 15 - SysTick\n"0" denotes the highest priority and "3" denotes the lowest priority.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>NVIC Register Map</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x180</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE00</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>NVIC_ISER0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_ISER0</displayName>
          <description>IRQ0 ~ IRQ159 Set-enable Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt Set Enable Bit\nThe NVIC_ISER0-NVIC_ISER3 registers enable interrupts, and show which interrupts are enabled\nWrite:\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect.\nInterrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="NVIC_ISER0">
          <name>NVIC_ISER1</name>
          <displayName>NVIC_ISER1</displayName>
          <description>IRQ0 ~ IRQ159 Set-enable Control Register</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="NVIC_ISER0">
          <name>NVIC_ISER2</name>
          <displayName>NVIC_ISER2</displayName>
          <description>IRQ0 ~ IRQ159 Set-enable Control Register</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="NVIC_ISER0">
          <name>NVIC_ISER3</name>
          <displayName>NVIC_ISER3</displayName>
          <description>IRQ0 ~ IRQ159 Set-enable Control Register</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="NVIC_ISER0">
          <name>NVIC_ISER4</name>
          <displayName>NVIC_ISER4</displayName>
          <description>IRQ0 ~ IRQ159 Set-enable Control Register</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register>
          <name>NVIC_ICER0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_ICER0</displayName>
          <description>IRQ0 ~ IRQ159 Clear-enable Control Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt Clear Enable Control\nThe NVIC_ICER0-NVIC_ICER3 registers disable interrupts, and show which interrupts are enabled.\nWrite:\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect.\nInterrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt Disabled.\nInterrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="NVIC_ICER0">
          <name>NVIC_ICER1</name>
          <displayName>NVIC_ICER1</displayName>
          <description>IRQ0 ~ IRQ159 Clear-enable Control Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="NVIC_ICER0">
          <name>NVIC_ICER2</name>
          <displayName>NVIC_ICER2</displayName>
          <description>IRQ0 ~ IRQ159 Clear-enable Control Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="NVIC_ICER0">
          <name>NVIC_ICER3</name>
          <displayName>NVIC_ICER3</displayName>
          <description>IRQ0 ~ IRQ159 Clear-enable Control Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="NVIC_ICER0">
          <name>NVIC_ICER4</name>
          <displayName>NVIC_ICER4</displayName>
          <description>IRQ0 ~ IRQ159 Clear-enable Control Register</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register>
          <name>NVIC_ISPR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_ISPR0</displayName>
          <description>IRQ0 ~ IRQ159 Set-pending Control Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt Set-Pending \nThe NVIC_ISPR0-NVIC_ISPR3 registers force interrupts into the pending state, and show which interrupts are pending\nWrite:\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect.\nInterrupt is not pending</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Changes interrupt state to pending.\nInterrupt is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="NVIC_ISPR0">
          <name>NVIC_ISPR1</name>
          <displayName>NVIC_ISPR1</displayName>
          <description>IRQ0 ~ IRQ159 Set-pending Control Register</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="NVIC_ISPR0">
          <name>NVIC_ISPR2</name>
          <displayName>NVIC_ISPR2</displayName>
          <description>IRQ0 ~ IRQ159 Set-pending Control Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="NVIC_ISPR0">
          <name>NVIC_ISPR3</name>
          <displayName>NVIC_ISPR3</displayName>
          <description>IRQ0 ~ IRQ159 Set-pending Control Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="NVIC_ISPR0">
          <name>NVIC_ISPR4</name>
          <displayName>NVIC_ISPR4</displayName>
          <description>IRQ0 ~ IRQ159 Set-pending Control Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register>
          <name>NVIC_ICPR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_ICPR0</displayName>
          <description>IRQ0 ~ IRQ159 Clear-pending Control Register</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt Clear-Pending\nThe NVIC_ICPR0-NCVIC_ICPR3 registers remove the pending state from interrupts, and show which interrupts are pending\nWrite:\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect.\nInterrupt is not pending</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Removes pending state an interrupt.\nInterrupt is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="NVIC_ICPR0">
          <name>NVIC_ICPR1</name>
          <displayName>NVIC_ICPR1</displayName>
          <description>IRQ0 ~ IRQ159 Clear-pending Control Register</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="NVIC_ICPR0">
          <name>NVIC_ICPR2</name>
          <displayName>NVIC_ICPR2</displayName>
          <description>IRQ0 ~ IRQ159 Clear-pending Control Register</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="NVIC_ICPR0">
          <name>NVIC_ICPR3</name>
          <displayName>NVIC_ICPR3</displayName>
          <description>IRQ0 ~ IRQ159 Clear-pending Control Register</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="NVIC_ICPR0">
          <name>NVIC_ICPR4</name>
          <displayName>NVIC_ICPR4</displayName>
          <description>IRQ0 ~ IRQ159 Clear-pending Control Register</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register>
          <name>NVIC_IABR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_IABR0</displayName>
          <description>IRQ0 ~ IRQ159 Active Bit Register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt Active Flags\nThe NVIC_IABR0-NVIC_IABR3 registers indicate which interrupts are active. \n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>interrupt not active</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>interrupt active</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
