cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="NVIC_IABR0">
          <name>NVIC_IABR1</name>
          <displayName>NVIC_IABR1</displayName>
          <description>IRQ0 ~ IRQ159 Active Bit Register</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="NVIC_IABR0">
          <name>NVIC_IABR2</name>
          <displayName>NVIC_IABR2</displayName>
          <description>IRQ0 ~ IRQ159 Active Bit Register</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="NVIC_IABR0">
          <name>NVIC_IABR3</name>
          <displayName>NVIC_IABR3</displayName>
          <description>IRQ0 ~ IRQ159 Active Bit Register</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IABR0">
          <name>NVIC_IABR4</name>
          <displayName>NVIC_IABR4</displayName>
          <description>IRQ0 ~ IRQ159 Active Bit Register</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register>
          <name>NVIC_IPR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_IPR0</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_4n0</name>
              <description>Priority Of IRQ_4n+0\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n1</name>
              <description>Priority Of IRQ_4n+1\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n2</name>
              <description>Priority Of IRQ_4n+2\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n3</name>
              <description>Priority Of IRQ_4n+3\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR1</name>
          <displayName>NVIC_IPR1</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x304</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR2</name>
          <displayName>NVIC_IPR2</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR3</name>
          <displayName>NVIC_IPR3</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR4</name>
          <displayName>NVIC_IPR4</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR5</name>
          <displayName>NVIC_IPR5</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR6</name>
          <displayName>NVIC_IPR6</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR7</name>
          <displayName>NVIC_IPR7</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR8</name>
          <displayName>NVIC_IPR8</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR9</name>
          <displayName>NVIC_IPR9</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR10</name>
          <displayName>NVIC_IPR10</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR11</name>
          <displayName>NVIC_IPR11</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR12</name>
          <displayName>NVIC_IPR12</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR13</name>
          <displayName>NVIC_IPR13</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x334</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR14</name>
          <displayName>NVIC_IPR14</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x338</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR15</name>
          <displayName>NVIC_IPR15</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x33C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR16</name>
          <displayName>NVIC_IPR16</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x340</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR17</name>
          <displayName>NVIC_IPR17</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR18</name>
          <displayName>NVIC_IPR18</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x348</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR19</name>
          <displayName>NVIC_IPR19</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x34C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR20</name>
          <displayName>NVIC_IPR20</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x350</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR21</name>
          <displayName>NVIC_IPR21</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x354</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR22</name>
          <displayName>NVIC_IPR22</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x358</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR23</name>
          <displayName>NVIC_IPR23</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x35C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR24</name>
          <displayName>NVIC_IPR24</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x360</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR25</name>
          <displayName>NVIC_IPR25</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x364</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR26</name>
          <displayName>NVIC_IPR26</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x368</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR27</name>
          <displayName>NVIC_IPR27</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x36C</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR28</name>
          <displayName>NVIC_IPR28</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x370</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR29</name>
          <displayName>NVIC_IPR29</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x374</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR30</name>
          <displayName>NVIC_IPR30</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x378</addressOffset>
       </register>
       <register derivedFrom="NVIC_IPR0">
          <name>NVIC_IPR31</name>
          <displayName>NVIC_IPR31</displayName>
          <description>IRQ0 ~ IRQ159 Interrupt Priority Control Register</description>
          <addressOffset>0x37C</addressOffset>
       </register>
       <register>
          <name>NVIC_STIR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_STIR</displayName>
          <description>Software Trigger Interrupt Registers</description>
          <addressOffset>0xE00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTID</name>
              <description>Interrupt ID\nWrite to the STIR To Generate An Interrupt from Software\nWhen the USERSETMPEND bit in the SCR is set to 1, unprivileged software can access the STIR\nInterrupt ID of the interrupt to trigger, in the range 0-63. For example, a value of 0x03 specifies interrupt IRQ3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
