cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="PA_PIN">
          <name>PD_PIN</name>
          <displayName>PD_PIN</displayName>
          <description>PD Pin Value</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PD_DBEN</name>
          <displayName>PD_DBEN</displayName>
          <description>PD De-bounce Enable Control</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PD_INTTYPE</name>
          <displayName>PD_INTTYPE</displayName>
          <description>PD Interrupt Trigger Type Register</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PD_INTEN</name>
          <displayName>PD_INTEN</displayName>
          <description>PD Interrupt Enable</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PD_INTSRC</name>
          <displayName>PD_INTSRC</displayName>
          <description>PD Interrupt Source Flag</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PD_SMTEN</name>
          <displayName>PD_SMTEN</displayName>
          <description>PD Input Schmitt Trigger Enable</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PD_SLEWCTL</name>
          <displayName>PD_SLEWCTL</displayName>
          <description>PD High Slew Rate Control</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PE_MODE</name>
          <displayName>PE_MODE</displayName>
          <description>PE I/O Mode Control</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PE_DINOFF</name>
          <displayName>PE_DINOFF</displayName>
          <description>PE Digital Input Path Disable Control</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="PA_DOUT">
          <name>PE_DOUT</name>
          <displayName>PE_DOUT</displayName>
          <description>PE Data Output Value</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PE_DATMSK</name>
          <displayName>PE_DATMSK</displayName>
          <description>PE Data Output Write Mask</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PE_PIN</name>
          <displayName>PE_PIN</displayName>
          <description>PE Pin Value</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PE_DBEN</name>
          <displayName>PE_DBEN</displayName>
          <description>PE De-bounce Enable Control</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PE_INTTYPE</name>
          <displayName>PE_INTTYPE</displayName>
          <description>PE Interrupt Trigger Type Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PE_INTEN</name>
          <displayName>PE_INTEN</displayName>
          <description>PE Interrupt Enable</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PE_INTSRC</name>
          <displayName>PE_INTSRC</displayName>
          <description>PE Interrupt Source Flag</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PE_SMTEN</name>
          <displayName>PE_SMTEN</displayName>
          <description>PE Input Schmitt Trigger Enable</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PE_SLEWCTL</name>
          <displayName>PE_SLEWCTL</displayName>
          <description>PE High Slew Rate Control</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PF_MODE</name>
          <displayName>PF_MODE</displayName>
          <description>PF I/O Mode Control</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PF_DINOFF</name>
          <displayName>PF_DINOFF</displayName>
          <description>PF Digital Input Path Disable Control</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="PA_DOUT">
          <name>PF_DOUT</name>
          <displayName>PF_DOUT</displayName>
          <description>PF Data Output Value</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PF_DATMSK</name>
          <displayName>PF_DATMSK</displayName>
          <description>PF Data Output Write Mask</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PF_PIN</name>
          <displayName>PF_PIN</displayName>
          <description>PF Pin Value</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PF_DBEN</name>
          <displayName>PF_DBEN</displayName>
          <description>PF De-bounce Enable Control</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PF_INTTYPE</name>
          <displayName>PF_INTTYPE</displayName>
          <description>PF Interrupt Trigger Type Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PF_INTEN</name>
          <displayName>PF_INTEN</displayName>
          <description>PF Interrupt Enable</description>
          <addressOffset>0x15C</addressOffset>
       </register>
