cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="PA_INTSRC">
          <name>PF_INTSRC</name>
          <displayName>PF_INTSRC</displayName>
          <description>PF Interrupt Source Flag</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PF_SMTEN</name>
          <displayName>PF_SMTEN</displayName>
          <description>PF Input Schmitt Trigger Enable</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PF_SLEWCTL</name>
          <displayName>PF_SLEWCTL</displayName>
          <description>PF High Slew Rate Control</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PG_MODE</name>
          <displayName>PG_MODE</displayName>
          <description>PG I/O Mode Control</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PG_DINOFF</name>
          <displayName>PG_DINOFF</displayName>
          <description>PG Digital Input Path Disable Control</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="PA_DOUT">
          <name>PG_DOUT</name>
          <displayName>PG_DOUT</displayName>
          <description>PG Data Output Value</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PG_DATMSK</name>
          <displayName>PG_DATMSK</displayName>
          <description>PG Data Output Write Mask</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PG_PIN</name>
          <displayName>PG_PIN</displayName>
          <description>PG Pin Value</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PG_DBEN</name>
          <displayName>PG_DBEN</displayName>
          <description>PG De-bounce Enable Control</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PG_INTTYPE</name>
          <displayName>PG_INTTYPE</displayName>
          <description>PG Interrupt Trigger Type Register</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PG_INTEN</name>
          <displayName>PG_INTEN</displayName>
          <description>PG Interrupt Enable</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PG_INTSRC</name>
          <displayName>PG_INTSRC</displayName>
          <description>PG Interrupt Source Flag</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PG_SMTEN</name>
          <displayName>PG_SMTEN</displayName>
          <description>PG Input Schmitt Trigger Enable</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PG_SLEWCTL</name>
          <displayName>PG_SLEWCTL</displayName>
          <description>PG High Slew Rate Control</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PH_MODE</name>
          <displayName>PH_MODE</displayName>
          <description>PH I/O Mode Control</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PH_DINOFF</name>
          <displayName>PH_DINOFF</displayName>
          <description>PH Digital Input Path Disable Control</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="PA_DOUT">
          <name>PH_DOUT</name>
          <displayName>PH_DOUT</displayName>
          <description>PH Data Output Value</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PH_DATMSK</name>
          <displayName>PH_DATMSK</displayName>
          <description>PH Data Output Write Mask</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PH_PIN</name>
          <displayName>PH_PIN</displayName>
          <description>PH Pin Value</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PH_DBEN</name>
          <displayName>PH_DBEN</displayName>
          <description>PH De-bounce Enable Control</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PH_INTTYPE</name>
          <displayName>PH_INTTYPE</displayName>
          <description>PH Interrupt Trigger Type Register</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PH_INTEN</name>
          <displayName>PH_INTEN</displayName>
          <description>PH Interrupt Enable</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PH_INTSRC</name>
          <displayName>PH_INTSRC</displayName>
          <description>PH Interrupt Source Flag</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PH_SMTEN</name>
          <displayName>PH_SMTEN</displayName>
          <description>PH Input Schmitt Trigger Enable</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PH_SLEWCTL</name>
          <displayName>PH_SLEWCTL</displayName>
          <description>PH High Slew Rate Control</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PI_MODE</name>
          <displayName>PI_MODE</displayName>
          <description>PI I/O Mode Control</description>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PI_DINOFF</name>
          <displayName>PI_DINOFF</displayName>
          <description>PI Digital Input Path Disable Control</description>
          <addressOffset>0x204</addressOffset>
       </register>
