cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="PA0_PDIO">
          <name>PD5_PDIO</name>
          <displayName>PD5_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8D4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD6_PDIO</name>
          <displayName>PD6_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8D8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD7_PDIO</name>
          <displayName>PD7_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8DC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD8_PDIO</name>
          <displayName>PD8_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8E0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD9_PDIO</name>
          <displayName>PD9_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8E4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD10_PDIO</name>
          <displayName>PD10_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8E8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD11_PDIO</name>
          <displayName>PD11_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8EC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD12_PDIO</name>
          <displayName>PD12_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8F0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD13_PDIO</name>
          <displayName>PD13_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8F4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD14_PDIO</name>
          <displayName>PD14_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8F8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD15_PDIO</name>
          <displayName>PD15_PDIO</displayName>
          <description>GPIO PD.n Pin Data Input/Output</description>
          <addressOffset>0x8FC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE0_PDIO</name>
          <displayName>PE0_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x900</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE1_PDIO</name>
          <displayName>PE1_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x904</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE2_PDIO</name>
          <displayName>PE2_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x908</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE3_PDIO</name>
          <displayName>PE3_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x90C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE4_PDIO</name>
          <displayName>PE4_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x910</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE5_PDIO</name>
          <displayName>PE5_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x914</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE6_PDIO</name>
          <displayName>PE6_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x918</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE7_PDIO</name>
          <displayName>PE7_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x91C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE8_PDIO</name>
          <displayName>PE8_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x920</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE9_PDIO</name>
          <displayName>PE9_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x924</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE10_PDIO</name>
          <displayName>PE10_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x928</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE11_PDIO</name>
          <displayName>PE11_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x92C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE12_PDIO</name>
          <displayName>PE12_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x930</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE13_PDIO</name>
          <displayName>PE13_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x934</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE14_PDIO</name>
          <displayName>PE14_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x938</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE15_PDIO</name>
          <displayName>PE15_PDIO</displayName>
          <description>GPIO PE.n Pin Data Input/Output</description>
          <addressOffset>0x93C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF0_PDIO</name>
          <displayName>PF0_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x940</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF1_PDIO</name>
          <displayName>PF1_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x944</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF2_PDIO</name>
          <displayName>PF2_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x948</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF3_PDIO</name>
          <displayName>PF3_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x94C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF4_PDIO</name>
          <displayName>PF4_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x950</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF5_PDIO</name>
          <displayName>PF5_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x954</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF6_PDIO</name>
          <displayName>PF6_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x958</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF7_PDIO</name>
          <displayName>PF7_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x95C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF8_PDIO</name>
          <displayName>PF8_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x960</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF9_PDIO</name>
          <displayName>PF9_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x964</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF10_PDIO</name>
          <displayName>PF10_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x968</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF11_PDIO</name>
          <displayName>PF11_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x96C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF12_PDIO</name>
          <displayName>PF12_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x970</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF13_PDIO</name>
          <displayName>PF13_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x974</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF14_PDIO</name>
          <displayName>PF14_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x978</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PF15_PDIO</name>
          <displayName>PF15_PDIO</displayName>
          <description>GPIO PF.n Pin Data Input/Output</description>
          <addressOffset>0x97C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG0_PDIO</name>
          <displayName>PG0_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x980</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG1_PDIO</name>
          <displayName>PG1_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x984</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG2_PDIO</name>
          <displayName>PG2_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x988</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG3_PDIO</name>
          <displayName>PG3_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x98C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG4_PDIO</name>
          <displayName>PG4_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x990</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG5_PDIO</name>
          <displayName>PG5_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x994</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG6_PDIO</name>
          <displayName>PG6_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x998</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG7_PDIO</name>
          <displayName>PG7_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x99C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG8_PDIO</name>
          <displayName>PG8_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9A0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG9_PDIO</name>
          <displayName>PG9_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9A4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG10_PDIO</name>
          <displayName>PG10_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9A8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG11_PDIO</name>
          <displayName>PG11_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9AC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG12_PDIO</name>
          <displayName>PG12_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9B0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG13_PDIO</name>
          <displayName>PG13_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9B4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG14_PDIO</name>
          <displayName>PG14_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9B8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PG15_PDIO</name>
          <displayName>PG15_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output</description>
          <addressOffset>0x9BC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH0_PDIO</name>
          <displayName>PH0_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9C0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH1_PDIO</name>
          <displayName>PH1_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9C4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH2_PDIO</name>
          <displayName>PH2_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9C8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH3_PDIO</name>
          <displayName>PH3_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9CC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH4_PDIO</name>
          <displayName>PH4_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9D0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH5_PDIO</name>
          <displayName>PH5_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9D4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH6_PDIO</name>
          <displayName>PH6_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9D8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH7_PDIO</name>
          <displayName>PH7_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9DC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH8_PDIO</name>
          <displayName>PH8_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9E0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH9_PDIO</name>
          <displayName>PH9_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9E4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH10_PDIO</name>
          <displayName>PH10_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9E8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH11_PDIO</name>
          <displayName>PH11_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9EC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH12_PDIO</name>
          <displayName>PH12_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9F0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH13_PDIO</name>
          <displayName>PH13_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9F4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH14_PDIO</name>
          <displayName>PH14_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9F8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH15_PDIO</name>
          <displayName>PH15_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output</description>
          <addressOffset>0x9FC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI0_PDIO</name>
          <displayName>PI0_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA00</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI1_PDIO</name>
          <displayName>PI1_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA04</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI2_PDIO</name>
          <displayName>PI2_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA08</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI3_PDIO</name>
          <displayName>PI3_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA0C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI4_PDIO</name>
          <displayName>PI4_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA10</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI5_PDIO</name>
          <displayName>PI5_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA14</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI6_PDIO</name>
          <displayName>PI6_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA18</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI7_PDIO</name>
          <displayName>PI7_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA1C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI8_PDIO</name>
          <displayName>PI8_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA20</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI9_PDIO</name>
          <displayName>PI9_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA24</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI10_PDIO</name>
          <displayName>PI10_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA28</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI11_PDIO</name>
          <displayName>PI11_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA2C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI12_PDIO</name>
          <displayName>PI12_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA30</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI13_PDIO</name>
          <displayName>PI13_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA34</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI14_PDIO</name>
          <displayName>PI14_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA38</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PI15_PDIO</name>
          <displayName>PI15_PDIO</displayName>
          <description>GPIO PI.n Pin Data Input/Output</description>
          <addressOffset>0xA3C</addressOffset>
       </register>
