cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT1_CTL</name>
          <displayName>PDMA_DSCT1_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 1</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT1_ENDSA</name>
          <displayName>PDMA_DSCT1_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 1</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT1_ENDDA</name>
          <displayName>PDMA_DSCT1_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 1</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT1_NEXT</name>
          <displayName>PDMA_DSCT1_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 1</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT2_CTL</name>
          <displayName>PDMA_DSCT2_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 2</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT2_ENDSA</name>
          <displayName>PDMA_DSCT2_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 2</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT2_ENDDA</name>
          <displayName>PDMA_DSCT2_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 2</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT2_NEXT</name>
          <displayName>PDMA_DSCT2_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 2</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT3_CTL</name>
          <displayName>PDMA_DSCT3_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 3</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT3_ENDSA</name>
          <displayName>PDMA_DSCT3_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 3</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT3_ENDDA</name>
          <displayName>PDMA_DSCT3_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 3</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT3_NEXT</name>
          <displayName>PDMA_DSCT3_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 3</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT4_CTL</name>
          <displayName>PDMA_DSCT4_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 4</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT4_ENDSA</name>
          <displayName>PDMA_DSCT4_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 4</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT4_ENDDA</name>
          <displayName>PDMA_DSCT4_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 4</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT4_NEXT</name>
          <displayName>PDMA_DSCT4_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 4</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT5_CTL</name>
          <displayName>PDMA_DSCT5_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 5</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT5_ENDSA</name>
          <displayName>PDMA_DSCT5_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 5</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT5_ENDDA</name>
          <displayName>PDMA_DSCT5_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 5</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT5_NEXT</name>
          <displayName>PDMA_DSCT5_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 5</description>
          <addressOffset>0x5C</addressOffset>
       </register>
