cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT6_CTL</name>
          <displayName>PDMA_DSCT6_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 6</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT6_ENDSA</name>
          <displayName>PDMA_DSCT6_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 6</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT6_ENDDA</name>
          <displayName>PDMA_DSCT6_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 6</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT6_NEXT</name>
          <displayName>PDMA_DSCT6_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 6</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT7_CTL</name>
          <displayName>PDMA_DSCT7_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 7</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT7_ENDSA</name>
          <displayName>PDMA_DSCT7_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 7</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT7_ENDDA</name>
          <displayName>PDMA_DSCT7_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 7</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT7_NEXT</name>
          <displayName>PDMA_DSCT7_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 7</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT8_CTL</name>
          <displayName>PDMA_DSCT8_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 8</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT8_ENDSA</name>
          <displayName>PDMA_DSCT8_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 8</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT8_ENDDA</name>
          <displayName>PDMA_DSCT8_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 8</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT8_NEXT</name>
          <displayName>PDMA_DSCT8_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 8</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT9_CTL</name>
          <displayName>PDMA_DSCT9_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 9</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT9_ENDSA</name>
          <displayName>PDMA_DSCT9_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 9</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT9_ENDDA</name>
          <displayName>PDMA_DSCT9_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 9</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT9_NEXT</name>
          <displayName>PDMA_DSCT9_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 9</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT10_CTL</name>
          <displayName>PDMA_DSCT10_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 10</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT10_ENDSA</name>
          <displayName>PDMA_DSCT10_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 10</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT10_ENDDA</name>
          <displayName>PDMA_DSCT10_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 10</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT10_NEXT</name>
          <displayName>PDMA_DSCT10_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 10</description>
          <addressOffset>0xAC</addressOffset>
       </register>
