cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT11_CTL</name>
          <displayName>PDMA_DSCT11_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 11</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT11_ENDSA</name>
          <displayName>PDMA_DSCT11_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 11</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT11_ENDDA</name>
          <displayName>PDMA_DSCT11_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 11</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT11_NEXT</name>
          <displayName>PDMA_DSCT11_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 11</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT12_CTL</name>
          <displayName>PDMA_DSCT12_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 12</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT12_ENDSA</name>
          <displayName>PDMA_DSCT12_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 12</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT12_ENDDA</name>
          <displayName>PDMA_DSCT12_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 12</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT12_NEXT</name>
          <displayName>PDMA_DSCT12_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 12</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT13_CTL</name>
          <displayName>PDMA_DSCT13_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 13</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT13_ENDSA</name>
          <displayName>PDMA_DSCT13_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 13</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT13_ENDDA</name>
          <displayName>PDMA_DSCT13_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 13</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT13_NEXT</name>
          <displayName>PDMA_DSCT13_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 13</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT14_CTL</name>
          <displayName>PDMA_DSCT14_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 14</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT14_ENDSA</name>
          <displayName>PDMA_DSCT14_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 14</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT14_ENDDA</name>
          <displayName>PDMA_DSCT14_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 14</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT14_NEXT</name>
          <displayName>PDMA_DSCT14_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 14</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT15_CTL</name>
          <displayName>PDMA_DSCT15_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel 15</description>
          <addressOffset>0xF0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDSA">
          <name>PDMA_DSCT15_ENDSA</name>
          <displayName>PDMA_DSCT15_ENDSA</displayName>
          <description>End Source Address Register of PDMA Channel 15</description>
          <addressOffset>0xF4</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_ENDDA">
          <name>PDMA_DSCT15_ENDDA</name>
          <displayName>PDMA_DSCT15_ENDDA</displayName>
          <description>End Destination Address Register of PDMA Channel 15</description>
          <addressOffset>0xF8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT15_NEXT</name>
          <displayName>PDMA_DSCT15_NEXT</displayName>
          <description>Scatter-gather Descriptor Table Offset Address of PDMA Channel 15</description>
          <addressOffset>0xFC</addressOffset>
       </register>
       <register>
          <name>PDMA_CURSCAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CURSCAT0</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 0</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>PDMA External Current Descriptor Address Bits\nThis field indicates a 32-bit current external descriptor address of PDMA.\nNote: This field is read only and only used for Scatter-Gather mode to indicate the current external descriptor address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT1</name>
          <displayName>PDMA_CURSCAT1</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 1</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT2</name>
          <displayName>PDMA_CURSCAT2</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 2</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT3</name>
          <displayName>PDMA_CURSCAT3</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 3</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT4</name>
          <displayName>PDMA_CURSCAT4</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 4</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT5</name>
          <displayName>PDMA_CURSCAT5</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 5</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT6</name>
          <displayName>PDMA_CURSCAT6</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 6</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT7</name>
          <displayName>PDMA_CURSCAT7</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 7</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT8</name>
          <displayName>PDMA_CURSCAT8</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 8</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT9</name>
          <displayName>PDMA_CURSCAT9</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 9</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT10</name>
          <displayName>PDMA_CURSCAT10</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 10</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT11</name>
          <displayName>PDMA_CURSCAT11</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 11</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT12</name>
          <displayName>PDMA_CURSCAT12</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 12</description>
          <addressOffset>0x130</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT13</name>
          <displayName>PDMA_CURSCAT13</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 13</description>
          <addressOffset>0x134</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT14</name>
          <displayName>PDMA_CURSCAT14</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 14</description>
          <addressOffset>0x138</addressOffset>
       </register>
       <register derivedFrom="PDMA_CURSCAT0">
          <name>PDMA_CURSCAT15</name>
          <displayName>PDMA_CURSCAT15</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel 15</description>
          <addressOffset>0x13C</addressOffset>
       </register>
       <register>
          <name>PDMA_CHCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CHCTL</displayName>
          <description>PDMA Channel Control Register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHEN</name>
              <description>PDMA Channel Enable Control Bit[X]\nSet this bit to 1 to enable PDMA[x] operation. \nNote1: If software stops each PDMA transfer by setting PDMA_STOP register, this bit will be cleared automatically after finishing current transfer.\nNote2: Software reset (writing 0xFFFF_FFF to PDMA_STOP register) will clear this bit.\nNote3: If each channel is not set as enabled, each channel cannot be active.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA channel [x] Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA channel [x] Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_STOP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_STOP</displayName>
          <description>PDMA Stop Transfer Register</description>
          <addressOffset>0x404</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STOP</name>
              <description>PDMA Stop Transfer Bit [X]\nUser can stop the PDMA transfer by software reset (writing all '1' to PDMA_STOP register) or by PDMA_STOP register.\nThe difference between software reset and PDMA_STOP register is when software set software reset, the operation will be stopped imminently that include the on-going transfer and the channel enable bit and request active flag will be cleared to '0'. When software set PDMA_STOP bit, the operation will finish the on-going transfer channel and then clear the channel enable bit and request active flag. Software can poll channel enable bit to know if the on-going transfer is finished.\nNote1: This field is Write-Only;\nNote2: Setting all PDMA_STOP bit to "1" will generate software reset to reset internal state machine (the embedded table will not be reset).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop PDMA transfer[x]</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_SWREQ</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_SWREQ</displayName>
          <description>PDMA Software Request Register</description>
          <addressOffset>0x408</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREQ</name>
              <description>PDMA Software Request Bit [X]\nSet this bit to 1 to generate a software request to PDMA [x].\nNote1: This field is Write-Only. Software can indicate which channel is on active by reading PDMA_TRGSTS register. Active flag may be triggered by software request or peripheral request.\nNote2: If user does not enable each PDMA channel, the software request will be ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Generate a software request</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_TRGSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_TRGSTS</displayName>
          <description>PDMA Request Active Flag Register</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSTS</name>
              <description>PDMA Request Active Flag [X]\nThis flag indicates whether channel[x] have a request or not.\nNote1: The request may come from software request (SWREQ) or peripheral request.\nNote2: When PDMA finishes channel transfer, this bit will be cleared automatically\nNote3: Software reset (setting PDMA_STOP to 0xFFFF_FFFF) will clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Have no requests</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Have a request</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_PRISET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_PRISET</displayName>
          <description>PDMA Fixed Priority Setting Register</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPRISET</name>
              <description>PDMA Fixed Priority Setting Bit[X]\nSet this bit to 1 to enable fix priority level.\nThe PDMA channel priority is shown in the following table.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set PDMA channel [x] be fixed priority channel</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_PRICLR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_PRICLR</displayName>
          <description>PDMA Fixed Priority Clear Register</description>
          <addressOffset>0x414</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPRICLR</name>
              <description>PDMA Fix Priority Clear Bit\nSet this bit to 1 to clear fixed priority level.\nNote: This field is Write-Only, and software can indicate the channel priority by reading PDMA_PRISET register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set PDMA channel [x] to be round-robin priority channel</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_INTEN</displayName>
          <description>PDMA Interrupt Enable Control Register</description>
          <addressOffset>0x418</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTEN</name>
              <description>PDMA Interrupt Enable\nThis field is used for enabling PDMA channel[x] interrupt.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA channel [x] interrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA channel [x] interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
