cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPKINTEN</name>
          <displayName>USBD_EPKINTEN</displayName>
          <description>Endpoint K Interrupt Enable Register</description>
          <addressOffset>0x1FC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPKDATCNT</name>
          <displayName>USBD_EPKDATCNT</displayName>
          <description>Endpoint K Data Available Count Register</description>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPKRSPCTL</name>
          <displayName>USBD_EPKRSPCTL</displayName>
          <description>Endpoint K Response Control Register</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPKMPS</name>
          <displayName>USBD_EPKMPS</displayName>
          <description>Endpoint K Maximum Packet Size Register</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPKTXCNT</name>
          <displayName>USBD_EPKTXCNT</displayName>
          <description>Endpoint K Transfer Count Register</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPKCFG</name>
          <displayName>USBD_EPKCFG</displayName>
          <description>Endpoint K Configuration Register</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPKBUFSTART</name>
          <displayName>USBD_EPKBUFSTART</displayName>
          <description>Endpoint K RAM Start Address Register</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPKBUFEND</name>
          <displayName>USBD_EPKBUFEND</displayName>
          <description>Endpoint K RAM End Address Register</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPLDAT</name>
          <displayName>USBD_EPLDAT</displayName>
          <description>Endpoint L Data Register</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPLINTSTS</name>
          <displayName>USBD_EPLINTSTS</displayName>
          <description>Endpoint L Interrupt Status Register</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPLINTEN</name>
          <displayName>USBD_EPLINTEN</displayName>
          <description>Endpoint L Interrupt Enable Register</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPLDATCNT</name>
          <displayName>USBD_EPLDATCNT</displayName>
          <description>Endpoint L Data Available Count Register</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPLRSPCTL</name>
          <displayName>USBD_EPLRSPCTL</displayName>
          <description>Endpoint L Response Control Register</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPLMPS</name>
          <displayName>USBD_EPLMPS</displayName>
          <description>Endpoint L Maximum Packet Size Register</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPLTXCNT</name>
          <displayName>USBD_EPLTXCNT</displayName>
          <description>Endpoint L Transfer Count Register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPLCFG</name>
          <displayName>USBD_EPLCFG</displayName>
          <description>Endpoint L Configuration Register</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPLBUFSTART</name>
          <displayName>USBD_EPLBUFSTART</displayName>
          <description>Endpoint L RAM Start Address Register</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPLBUFEND</name>
          <displayName>USBD_EPLBUFEND</displayName>
          <description>Endpoint L RAM End Address Register</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register>
          <name>USBD_DMAADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_DMAADDR</displayName>
          <description>AHB DMA Address Register</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMAADDR\nThe register specifies the address from which the DMA has to read / write. The address must WORD (32-bit) aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>USBD_PHYCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_PHYCTL</displayName>
          <description>USB PHY Control Register</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000420</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPPUEN</name>
              <description>DP Pull-Up\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pull-up resistor on D+ Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pull-up resistor on D+ Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYEN</name>
              <description>PHY Suspend Enable Bit\n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The USB PHY is suspend</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The USB PHY is not suspend</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKEN</name>
              <description>Wake-Up Enable Bit\n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSDET</name>
              <description>VBUS Status\n</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The VBUS is not detected yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The VBUS is detected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
