cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDH</name>
      <description>SDH Register Map</description>
      <groupName>SDH</groupName>
      <baseAddress>0x4000D000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x408</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x800</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x820</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>SDH_FB_0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_0</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_1</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_2</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_3</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_4</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_5</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_5</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_6</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_6</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_7</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_7</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_8</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_8</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_9</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_9</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_10</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_10</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_11</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_11</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_12</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_12</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_13</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_13</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_14</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_14</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_15</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_15</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_16</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_16</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_17</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_17</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_18</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_18</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_19</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_19</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_20</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_20</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_21</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_21</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_22</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_22</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_23</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_23</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_24</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_24</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_25</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_25</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_26</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_26</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_27</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_27</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x6C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_28</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_28</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_29</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_29</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_30</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_30</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x78</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_FB_31</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_31</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x7C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>SDH_DMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMACTL</displayName>
          <description>DMA Control and Status Register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA Engine Enable Bit\nIf this bit is cleared, DMA will ignore all requests from SD host and force bus master into IDLE state.\nNote: If target abort is occurred, DMAEN will be cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARST</name>
              <description>Software Engine Reset\nNote: The software reset DMA related registers.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset internal state machine and pointers. The contents of control register will not be cleared. This bit will auto be cleared after few clock cycles</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SGEN</name>
              <description>Scatter-Gather Function Enable Bit\n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Scatter-gather function Disabled (DMA will treat the starting address in DMASAR as starting pointer of a single block memory)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Scatter-gather function Enabled (DMA will treat the starting address in DMASAR as a starting address of Physical Address Descriptor (PAD) table. The format of these Pads' will be described later)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>DMA Transfer Is In Progress\nThis bit indicates if SD Host is granted and doing DMA transfer or not.\n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA transfer is not in progress</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA transfer is in progress</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_DMASA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMASA</displayName>
          <description>DMA Transfer Starting Address Register</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORDER</name>
              <description>Determined To The PAD Table Fetching Is In Order Or Out Of Order\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PAD table is fetched in order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PAD table is fetched out of order</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASA</name>
              <description>DMA Transfer Starting Address\nThis field pads 0 as least significant bit indicates a 32-bit starting address of system memory (SRAM) for DMA to retrieve or fill in data.\nIf DMA is not in normal mode, this field will be interpreted as a starting address of Physical Address Descriptor (PAD) table.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_DMABCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMABCNT</displayName>
          <description>DMA Transfer Byte Count Register</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCNT</name>
              <description>DMA Transfer Byte Count (Read Only)\nThis field indicates the remained byte count of DMA transfer. The value of this field is valid only when DMA is busy; otherwise, it is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
