cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="CRPT_AES0_SADDR">
          <name>CRPT_AES1_SADDR</name>
          <displayName>CRPT_AES1_SADDR</displayName>
          <description>AES DMA Source Address Register for Channel 1</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_DADDR">
          <name>CRPT_AES1_DADDR</name>
          <displayName>CRPT_AES1_DADDR</displayName>
          <description>AES DMA Destination Address Register for Channel 1</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_CNT">
          <name>CRPT_AES1_CNT</name>
          <displayName>CRPT_AES1_CNT</displayName>
          <description>AES Byte Count Register for Channel 1</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY0</name>
          <displayName>CRPT_AES2_KEY0</displayName>
          <description>AES Key Word 0 Register for Channel 2</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY1</name>
          <displayName>CRPT_AES2_KEY1</displayName>
          <description>AES Key Word 1 Register for Channel 2</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY2</name>
          <displayName>CRPT_AES2_KEY2</displayName>
          <description>AES Key Word 2 Register for Channel 2</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY3</name>
          <displayName>CRPT_AES2_KEY3</displayName>
          <description>AES Key Word 3 Register for Channel 2</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY4</name>
          <displayName>CRPT_AES2_KEY4</displayName>
          <description>AES Key Word 4 Register for Channel 2</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY5</name>
          <displayName>CRPT_AES2_KEY5</displayName>
          <description>AES Key Word 5 Register for Channel 2</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY6</name>
          <displayName>CRPT_AES2_KEY6</displayName>
          <description>AES Key Word 6 Register for Channel 2</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES2_KEY7</name>
          <displayName>CRPT_AES2_KEY7</displayName>
          <description>AES Key Word 7 Register for Channel 2</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES2_IV0</name>
          <displayName>CRPT_AES2_IV0</displayName>
          <description>AES Initial Vector Word 0 Register for Channel 2</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES2_IV1</name>
          <displayName>CRPT_AES2_IV1</displayName>
          <description>AES Initial Vector Word 1 Register for Channel 2</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES2_IV2</name>
          <displayName>CRPT_AES2_IV2</displayName>
          <description>AES Initial Vector Word 2 Register for Channel 2</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES2_IV3</name>
          <displayName>CRPT_AES2_IV3</displayName>
          <description>AES Initial Vector Word 3 Register for Channel 2</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_SADDR">
          <name>CRPT_AES2_SADDR</name>
          <displayName>CRPT_AES2_SADDR</displayName>
          <description>AES DMA Source Address Register for Channel 2</description>
          <addressOffset>0x1B8</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_DADDR">
          <name>CRPT_AES2_DADDR</name>
          <displayName>CRPT_AES2_DADDR</displayName>
          <description>AES DMA Destination Address Register for Channel 2</description>
          <addressOffset>0x1BC</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_CNT">
          <name>CRPT_AES2_CNT</name>
          <displayName>CRPT_AES2_CNT</displayName>
          <description>AES Byte Count Register for Channel 2</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY0</name>
          <displayName>CRPT_AES3_KEY0</displayName>
          <description>AES Key Word 0 Register for Channel 3</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY1</name>
          <displayName>CRPT_AES3_KEY1</displayName>
          <description>AES Key Word 1 Register for Channel 3</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY2</name>
          <displayName>CRPT_AES3_KEY2</displayName>
          <description>AES Key Word 2 Register for Channel 3</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY3</name>
          <displayName>CRPT_AES3_KEY3</displayName>
          <description>AES Key Word 3 Register for Channel 3</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY4</name>
          <displayName>CRPT_AES3_KEY4</displayName>
          <description>AES Key Word 4 Register for Channel 3</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY5</name>
          <displayName>CRPT_AES3_KEY5</displayName>
          <description>AES Key Word 5 Register for Channel 3</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY6</name>
          <displayName>CRPT_AES3_KEY6</displayName>
          <description>AES Key Word 6 Register for Channel 3</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_KEY0">
          <name>CRPT_AES3_KEY7</name>
          <displayName>CRPT_AES3_KEY7</displayName>
          <description>AES Key Word 7 Register for Channel 3</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES3_IV0</name>
          <displayName>CRPT_AES3_IV0</displayName>
          <description>AES Initial Vector Word 0 Register for Channel 3</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES3_IV1</name>
          <displayName>CRPT_AES3_IV1</displayName>
          <description>AES Initial Vector Word 1 Register for Channel 3</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES3_IV2</name>
          <displayName>CRPT_AES3_IV2</displayName>
          <description>AES Initial Vector Word 2 Register for Channel 3</description>
          <addressOffset>0x1EC</addressOffset>
       </register>
       <register derivedFrom="CRPT_AES0_IV0">
          <name>CRPT_AES3_IV3</name>
          <displayName>CRPT_AES3_IV3</displayName>
          <description>AES Initial Vector Word 3 Register for Channel 3</description>
          <addressOffset>0x1F0</addressOffset>
       </register>
