cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES0_KEY2L</name>
          <displayName>CRPT_TDES0_KEY2L</displayName>
          <description>TDES Key 2 Low Word Register for Channel 0</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES0_KEY3H</name>
          <displayName>CRPT_TDES0_KEY3H</displayName>
          <description>TDES Key 3 High Word Register for Channel 0</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES0_KEY3L</name>
          <displayName>CRPT_TDES0_KEY3L</displayName>
          <description>TDES Key 3 Low Word Register for Channel 0</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register>
          <name>CRPT_TDES0_IVH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_TDES0_IVH</displayName>
          <description>TDES/DES Initial Vector High Word Register for Channel 0</description>
          <addressOffset>0x220</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IVH_IVL</name>
              <description>TDES/DES Initial Vector High/Low Word\nInitial vector (IV) is for TDES/DES engine in CBC, CFB, and OFB mode. IV is Nonce counter for TDES/DES engine in CTR mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRPT_TDES0_IVH">
          <name>CRPT_TDES0_IVL</name>
          <displayName>CRPT_TDES0_IVL</displayName>
          <description>TDES/DES Initial Vector Low Word Register for Channel 0</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register>
          <name>CRPT_TDES0_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_TDES0_SADDR</displayName>
          <description>TDES/DES DMA Source Address Register for Channel 0</description>
          <addressOffset>0x228</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>TDES/DES DMA Source Address\nThe TDES/DES accelerator supports DMA function to transfer the plain text between system memory and embedded FIFO. The CRPT_TDESn_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the TDES/DES accelerator can read the plain text from system memory and do TDES/DES operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRPT_TDESn_SADDR are ignored.\nTDES_SADR can be read and written. Writing to TDES_SADR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation. But the value of CRPT_TDESn_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next TDES/DES operation.\nIn DMA mode, software can update the next CRPT_TDESn_SADDR before triggering START.\nCRPT_TDESn_SADDR and CRPT_TDESn_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_TDES0_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_TDES0_DADDR</displayName>
          <description>TDES/DES DMA Destination Address Register for Channel 0</description>
          <addressOffset>0x22C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>TDES/DES DMA Destination Address\nThe TDES/DES accelerator supports DMA function to transfer the cipher text between system memory and embedded FIFO. The CRPT_TDESn_DADDR keeps the destination address of the data buffer where the engine output's text will be stored. Based on the destination address, the TDES/DES accelerator can write the cipher text back to system memory after the TDES/DES operation is finished. The start of destination address should be located at word boundary. In other words, bit 1 and 0 of CRPT_TDESn_DADDR are ignored.\nTDES_DADR can be read and written. Writing to TDES_DADR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation. But the value of CRPT_TDESn_DADDR will be updated later on. Consequently, software can prepare the destination address for the next TDES/DES operation.\nIn DMA mode, software can update the next CRPT_TDESn_DADDR before triggering START. \nCRPT_TDESn_SADDR and CRPT_TDESn_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_TDES0_CNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_TDES0_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 0</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>TDES/DES Byte Count \nThe CRPT_TDESn_CNT keeps the byte count of source text that is for the TDES/DES engine operating in DMA mode. The CRPT_TDESn_CNT is 32-bit and the maximum of byte count is 4G bytes.\nCRPT_TDESn_CNT can be read and written. Writing to CRPT_TDESn_CNT while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation. But the value of CRPT_TDESn_CNT will be updated later on. Consequently, software can prepare the byte count of data for the next TDES /DES operation.\nIn Non-DMA ECB, CBC, CFB, OFB, and CTR mode, TDES_CNT must be set as byte count for the last block of data before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_TDES_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_TDES_DATIN</displayName>
          <description>TDES/DES Engine Input Data Word Register</description>
          <addressOffset>0x234</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>TDES/DES Engine Input Port\nCPU feeds data to TDES/DES engine through this port by checking CRPT_TDES_STS. Feed data as INBUFFULL is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_TDES_DATOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_TDES_DATOUT</displayName>
          <description>TDES/DES Engine Output Data Word Register</description>
          <addressOffset>0x238</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATOUT</name>
              <description>TDES/DES Engine Output Port\nCPU gets result from the TDES/DES engine through this port by checking CRPT_TDES_STS. Get data as OUTBUFEMPTY is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES1_KEY1H</name>
          <displayName>CRPT_TDES1_KEY1H</displayName>
          <description>TDES/DES Key 1 High Word Register for Channel 1</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES1_KEY1L</name>
          <displayName>CRPT_TDES1_KEY1L</displayName>
          <description>TDES/DES Key 1 Low Word Register for Channel 1</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES1_KEY2H</name>
          <displayName>CRPT_TDES1_KEY2H</displayName>
          <description>TDES Key 2 High Word Register for Channel 1</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES1_KEY2L</name>
          <displayName>CRPT_TDES1_KEY2L</displayName>
          <description>TDES Key 2 Low Word Register for Channel 1</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES1_KEY3H</name>
          <displayName>CRPT_TDES1_KEY3H</displayName>
          <description>TDES Key 3 High Word Register for Channel 1</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_KEY1H">
          <name>CRPT_TDES1_KEY3L</name>
          <displayName>CRPT_TDES1_KEY3L</displayName>
          <description>TDES Key 3 Low Word Register for Channel 1</description>
          <addressOffset>0x25C</addressOffset>
       </register>
