cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="CRPT_TDES0_IVH">
          <name>CRPT_TDES3_IVH</name>
          <displayName>CRPT_TDES3_IVH</displayName>
          <description>TDES/DES Initial Vector High Word Register for Channel 3</description>
          <addressOffset>0x2E0</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_IVH">
          <name>CRPT_TDES3_IVL</name>
          <displayName>CRPT_TDES3_IVL</displayName>
          <description>TDES/DES Initial Vector Low Word Register for Channel 3</description>
          <addressOffset>0x2E4</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_SADDR">
          <name>CRPT_TDES3_SADDR</name>
          <displayName>CRPT_TDES3_SADDR</displayName>
          <description>TDES/DES DMA Source Address Register for Channel 3</description>
          <addressOffset>0x2E8</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_DADDR">
          <name>CRPT_TDES3_DADDR</name>
          <displayName>CRPT_TDES3_DADDR</displayName>
          <description>TDES/DES DMA Destination Address Register for Channel 3</description>
          <addressOffset>0x2EC</addressOffset>
       </register>
       <register derivedFrom="CRPT_TDES0_CNT">
          <name>CRPT_TDES3_CNT</name>
          <displayName>CRPT_TDES3_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 3</description>
          <addressOffset>0x2F0</addressOffset>
       </register>
       <register>
          <name>CRPT_SHA_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_CTL</displayName>
          <description>SHA Control Register</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>SHA Engine Start\nNote: This bit is always 0 when it's read back.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start SHA engine. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>SHA Engine Stop\nNote: This bit is always 0 when it's read back.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop SHA engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALAST</name>
              <description>SHA Last Block\nIn DMA mode, this bit must be set as beginning the last DMA cascade round.\nIn Non-DMA mode, this bit must be set as feeding in last byte of data.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>SHA Engine DMA Enable Bit\nThe SHA engine operates in DMA mode, and data movement from/to the engine is done by DMA logic.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA_DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA_DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE</name>
              <description>SHA Engine Operation Modes\nNote: These bits can be read and written, but writing to them wouldn't take effect as BUSY is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA160</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SHA256</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>SHA224</description>
                    <value>#101</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSWAP</name>
              <description>SHA Engine Output Data Swap\n</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INSWAP</name>
              <description>SHA Engine Input Data Swap\n</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_SHA_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_STS</displayName>
          <description>SHA Status Flag</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>SHA Engine Busy \n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>SHA Engine DMA Busy Flag\n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA DMA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA DMA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAERR</name>
              <description>SHA Engine DMA Error Flag\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Show the SHA engine access normal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Show the SHA engine access error</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DATINREQ</name>
              <description>SHA Non-DMA Mode Data Input Request\n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Request SHA Non-DMA mode data input</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_SHA_DGST0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_DGST0</displayName>
          <description>SHA Digest Message 0</description>
          <addressOffset>0x308</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DGST</name>
              <description>SHA Digest Message Word\nFor SHA-160, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST4.\nFor SHA-224, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST6.\nFor SHA-256, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
