cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST1</name>
          <displayName>CRPT_SHA_DGST1</displayName>
          <description>SHA Digest Message 1</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST2</name>
          <displayName>CRPT_SHA_DGST2</displayName>
          <description>SHA Digest Message 2</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST3</name>
          <displayName>CRPT_SHA_DGST3</displayName>
          <description>SHA Digest Message 3</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST4</name>
          <displayName>CRPT_SHA_DGST4</displayName>
          <description>SHA Digest Message 4</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST5</name>
          <displayName>CRPT_SHA_DGST5</displayName>
          <description>SHA Digest Message 5</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST6</name>
          <displayName>CRPT_SHA_DGST6</displayName>
          <description>SHA Digest Message 6</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="CRPT_SHA_DGST0">
          <name>CRPT_SHA_DGST7</name>
          <displayName>CRPT_SHA_DGST7</displayName>
          <description>SHA Digest Message 7</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register>
          <name>CRPT_SHA_KEYCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_KEYCNT</displayName>
          <description>SHA Key Byte Count Register</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYCNT</name>
              <description>SHA Key Byte Count\nThe CRPT_SHA_KEYCNT keeps the byte count of key that SHA engine operates. The register is 32-bit and the maximum byte count is 4G bytes. It can be read and written. \nWriting to the register CRPT_SHA_KEYCNT as the SHA accelerator operating doesn't affect the current SHA operation. But the value of CRPT_SHA_KEYCNT will be updated later on. Consequently, software can prepare the key count for the next SHA operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_SHA_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_SADDR</displayName>
          <description>SHA DMA Source Address Register</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>SHA DMA Source Address\nThe SHA accelerator supports DMA function to transfer the plain text between system memory and embedded FIFO. The CRPT_SHA_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the SHA accelerator can read the plain text from system memory and do SHA operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRPT_SHA_SADDR are ignored.\nCRPT_SHA_SADDR can be read and written. Writing to CRPT_SHA_SADDR while the SHA accelerator is operating doesn't affect the current SHA operation. But the value of CRPT_SHA_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next SHA operation.\nIn DMA mode, software can update the next TDES_SADR before triggering START.\nCRPT_SHA_SADDR and CRPT_SHA_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_SHA_DMACNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_DMACNT</displayName>
          <description>SHA Byte Count Register</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACNT</name>
              <description>SHA Operation Byte Count\nThe CRPT_SHA_DMACNT keeps the byte count of source text that is for the SHA engine operating in DMA mode. The CRPT_SHA_DMACNT is 32-bit and the maximum of byte count is 4G bytes.\nCRPT_SHA_DMACNT can be read and written. Writing to CRPT_SHA_DMACNT while the SHA accelerator is operating doesn't affect the current SHA operation. But the value of CRPT_SHA_DMACNT will be updated later on. Consequently, software can prepare the byte count of data for the next SHA operation.\nIn Non-DMA mode, CRPT_SHA_DMACNT must be set as the byte count of the last block before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRPT_SHA_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRPT_SHA_DATIN</displayName>
          <description>SHA Engine Non-dMA Mode Data Input Port Register</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>SHA Engine Input Port\nCPU feeds data to SHA engine through this port by checking CRPT_SHA_STS. Feed data as DATINREQ is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
