cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
       <register>
          <name>CAP_CURADDRP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_CURADDRP</displayName>
          <description>Current Packet System Memory Address Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Packet Output Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_CURADDRY</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_CURADDRY</displayName>
          <description>Current Planar Y System Memory Address Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Planar Y Output Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_CURADDRU</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_CURADDRU</displayName>
          <description>Current Planar U System Memory Address Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Planar U Output Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_CURVADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_CURVADDR</displayName>
          <description>Current Planar V System Memory Address Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Planar V Output Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_PKTBA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_PKTBA0</displayName>
          <description>System Memory Packet Base Address 0 Register</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Packet Base Address 0\nWord aligns address; ignore the bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_PKTBA1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_PKTBA1</displayName>
          <description>System Memory Packet Base Address 1 Register</description>
          <addressOffset>0x64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Packet Base Address 1\nWord aligns address; ignore the bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_YBA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_YBA</displayName>
          <description>System Memory Planar Y Base Address Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Planar Y Base Address\nWord aligns address; ignore the bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_UBA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_UBA</displayName>
          <description>System Memory Planar U Base Address Register</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Planar U Base Address\nWord aligns address; ignore the bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAP_VBA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAP_VBA</displayName>
          <description>System Memory Planar V Base Address Register</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Planar V Base Address\nWord aligns address; ignore the bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
