cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EADC</name>
      <description>EADC Register Map</description>
      <groupName>EADC</groupName>
      <baseAddress>0x40044000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA4</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x120</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>EADC_AD0DAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_AD0DAT0</displayName>
          <description>A/D Data Register 0 for SAMPLE00</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>A/D Conversion Result\nThis field contains 12 bits conversion result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT (EADC_ADnDATx[11:0]) is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT (EADC_ADnDATx[11:0]) is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT (EADC_ADnDATx[11:0]) is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT1</name>
          <displayName>EADC_AD0DAT1</displayName>
          <description>A/D Data Register 1 for SAMPLE01</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT2</name>
          <displayName>EADC_AD0DAT2</displayName>
          <description>A/D Data Register 2 for SAMPLE02</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT3</name>
          <displayName>EADC_AD0DAT3</displayName>
          <description>A/D Data Register 3 for SAMPLE03</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT4</name>
          <displayName>EADC_AD0DAT4</displayName>
          <description>A/D Data Register 4 for SAMPLE04</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT5</name>
          <displayName>EADC_AD0DAT5</displayName>
          <description>A/D Data Register 5 for SAMPLE05</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT6</name>
          <displayName>EADC_AD0DAT6</displayName>
          <description>A/D Data Register 6 for SAMPLE06</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD0DAT7</name>
          <displayName>EADC_AD0DAT7</displayName>
          <description>A/D Data Register 7 for SAMPLE07</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT0</name>
          <displayName>EADC_AD1DAT0</displayName>
          <description>A/D Data Register 8 for SAMPLE10</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT1</name>
          <displayName>EADC_AD1DAT1</displayName>
          <description>A/D Data Register 9 for SAMPLE11</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT2</name>
          <displayName>EADC_AD1DAT2</displayName>
          <description>A/D Data Register 10 for SAMPLE12</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT3</name>
          <displayName>EADC_AD1DAT3</displayName>
          <description>A/D Data Register 11 for SAMPLE13</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT4</name>
          <displayName>EADC_AD1DAT4</displayName>
          <description>A/D Data Register 12 for SAMPLE14</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT5</name>
          <displayName>EADC_AD1DAT5</displayName>
          <description>A/D Data Register 13 for SAMPLE15</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT6</name>
          <displayName>EADC_AD1DAT6</displayName>
          <description>A/D Data Register 14 for SAMPLE16</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0DAT0">
          <name>EADC_AD1DAT7</name>
          <displayName>EADC_AD1DAT7</displayName>
          <description>A/D Data Register 15 for SAMPLE17</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register>
          <name>EADC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_CTL</displayName>
          <description>A/D Control Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRG7_0</name>
              <description>A/D SAMPLE07~SAMPLE00 Software Force To Start ADC Conversion\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start an ADC conversion when the priority is given to SAMPLE0x</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTRG15_8</name>
              <description>A/D SAMPLE17~SAMPLE10 Software Force To Start ADC Conversion\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start an ADC conversion when the priority is given to SAMPLE1x</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_SWTRG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SWTRG</displayName>
          <description>A/D SAMPLE Module Software Start Register</description>
          <addressOffset>0x48</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>EADC_PENDSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_PENDSTS</displayName>
          <description>A/D Start of Conversion Pending Flag Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STPF7_0</name>
              <description>A/D SAMPLE07~SAMPLE00 Start Of Conversion Pending Flag\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There is no pending conversion for SAMPLE0x</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SAMPLE0x ADC start of conversion is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>STPF15_8</name>
              <description>A/D SAMPLE17~SAMPLE10 Start Of Conversion Pending Flag \n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There is no pending conversion for SAMPLE1x</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SAMPLE1x ADC start of conversion is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_ADIFOV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_ADIFOV</displayName>
          <description>A/D ADINT3~0 Interrupt Flag Overrun Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPOVF7_0</name>
              <description>A/D SAMPLE07~SAMPLE00 Start Of Conversion Overrun Flag\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SAMPLE0x event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates a new SAMPLE0x event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPOVF15_8</name>
              <description>A/D SAMPLE17~SAMPLE10 Start Of Conversion Overrun Flag\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SAMPLE1x event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates a new SAMPLE1x event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_OVSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_OVSTS</displayName>
          <description>A/D SAMPLE Module Start of Conversion Overrun Flag Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
