cmsis-svd/cmsis-svd/data/Nuvoton/NUC400_v1.svd
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM01CEN</name>
              <description>PWM0_CH1 Center Trigger Enable Bit\n</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD0TRGEN1</name>
          <displayName>EADC_AD0TRGEN1</displayName>
          <description>A/D Trigger Condition for SAMPLE01</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD0TRGEN2</name>
          <displayName>EADC_AD0TRGEN2</displayName>
          <description>A/D Trigger Condition for SAMPLE02</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD0TRGEN3</name>
          <displayName>EADC_AD0TRGEN3</displayName>
          <description>A/D Trigger Condition for SAMPLE03</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD1TRGEN0</name>
          <displayName>EADC_AD1TRGEN0</displayName>
          <description>A/D Trigger Condition for SAMPLE10</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD1TRGEN1</name>
          <displayName>EADC_AD1TRGEN1</displayName>
          <description>A/D Trigger Condition for SAMPLE11</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD1TRGEN2</name>
          <displayName>EADC_AD1TRGEN2</displayName>
          <description>A/D Trigger Condition for SAMPLE12</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="EADC_AD0TRGEN0">
          <name>EADC_AD1TRGEN3</name>
          <displayName>EADC_AD1TRGEN3</displayName>
          <description>A/D Trigger Condition for SAMPLE13</description>
          <addressOffset>0x160</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA</name>
      <description>OPS Register Map</description>
      <groupName>OPS</groupName>
      <baseAddress>0x40046000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>OPA_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OPA_CTL</displayName>
          <description>OP Amplifier Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPEN0</name>
              <description>OP Amplifier 0 Enable Bit\nNote: OP Amplifier 0 output needs wait stable 20&#956;s after OPEN0 is first set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPEN1</name>
              <description>OP Amplifier 1 Enable Bit\nNote: OP Amplifier 1 output needs wait stable 20&#956;s after OPEN1 is first set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPSMTEN0</name>
              <description>OP Amplifier 0 Schmitt Trigger Non-Inverting Buffer Enable Bit\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPSMTEN1</name>
              <description>OP Amplifier 1 Schmitt Trigger Non-Inverting Buffer Enable Bit\n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPAIE0</name>
              <description>OP Amplifier 0 Schmitt Trigger Digital Output Interrupt Enable Bit\nThe OPDF0 interrupt flag is set by hardware whenever the OP amplifier 0 Schmitt trigger non-inverting buffer digital output changes state, in the meanwhile, if OPAIE0 is set to 1, a comparator interrupt request is generated.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OP Amplifier 0 digital output interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OP Amplifier 0 digital output interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPAIE1</name>
              <description>OP Amplifier 1 Schmitt Trigger Digital Output Interrupt Enable Bit\nOPDF1 interrupt flag is set by hardware whenever the OP amplifier 1 Schmitt trigger non-inverting buffer digital output changes state, in the meanwhile, if OPAIE1 is set to 1, a comparator interrupt request is generated.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OP Amplifier 1 digital output interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OP Amplifier 1 digital output interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>OPA_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>OPA_STATUS</displayName>
          <description>OP Amplifier Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPDO0</name>
              <description>OP Amplifier 0 Digital Output\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPDO1</name>
              <description>OP Amplifier 1 Digital Output\n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPDF0</name>
              <description>OP Amplifier 0 Schmitt Trigger Digital Output Interrupt Flag\nOPDF0 interrupt flag is set by hardware whenever the OP amplifier 0 Schmitt trigger non-inverting buffer digital output changes state. This bit is cleared by writing 1 to it.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPDF1</name>
              <description>OP Amplifier 1 Schmitt Trigger Digital Output Interrupt Flag\nOPDF1 interrupt flag is set by hardware whenever the OP amplifier 1 Schmitt trigger non-inverting buffer digital output changes state. This bit is cleared by writing 1 to it.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
